[
  {
    "id": 1,
    "type": "work",
    "organisation": "DVSA",
    "role": "Software Engineer",
    "startYear": "2024",
    "endYear": "Current",
    "description": "Maintained the Vehicle Operator Licence service with modern development approaches that enhanced user experience for over 20,000 UK businesses. Started the containerisation initiative on VOL creating base PHP Docker images and rewrote a Java 17 API into TypeScript improving maintainability and service security.",
    "languages": [
      "TypeScript",
      "PHP"
    ],
    "technologies": [
      "Docker",
      "Lamanias",
      "AWS",
      "MySQL"
    ]
  },
  {
    "id": 2,
    "type": "education",
    "organisation": "University of Roehampton",
    "role": "BSc Digital Technology Solutions",
    "startYear": "2024",
    "endYear": "Current",
    "description": "Designed and developed business-focused applications and systems architecture like database functionality and developer tools, while demonstrating strong theoretical understanding through academic writing on enterprise systems, maintaining performance consistent with upper second-class honors.",
    "languages": [
      "Go",
      "Python"
    ],
    "technologies": [
      "AWS",
      "MySQL"
    ]
  },
  {
    "id": 3,
    "type": "work",
    "organisation": "LEGO",
    "role": "Retail Marketing Intern",
    "startYear": "2022",
    "endYear": "2022",
    "description": "Collaborated with a team of six to develop an innovative in-store retail activation concept for LEGO, gathering strategic insights through specialist consultations and delivering a comprehensive presentation that demonstrated seamless integration of data capture solutions within existing infrastructure, complete with defined roles and implementation strategies."
  },
  {
    "id": 4,
    "type": "education",
    "organisation": "Fullbrook 6th Form",
    "role": "A Level Computer Science, Maths, Physics",
    "startYear": "2021",
    "endYear": "2023",
    "description": "Studied foundational topics like calculus, Newtonian mechanics, and data structures and algorithms, achieving a C grade average overall while excelling with a perfect score of 100% in computer science coursework assignment.",
    "languages": [
      "VB.Net"
    ],
    "technologies": [
      "MySQL"
    ]
  }
]
